zhenkun-cnm/MSPM0/board/empty/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define GPIO_HFXT_PORT                                                     GPIOA
#define GPIO_HFXIN_PIN                                             DL_GPIO_PIN_5
#define GPIO_HFXIN_IOMUX                                         (IOMUX_PINCM10)
#define GPIO_HFXOUT_PIN                                            DL_GPIO_PIN_6
#define GPIO_HFXOUT_IOMUX                                        (IOMUX_PINCM11)
#define CPUCLK_FREQ                                                     80000000
/* Defines for SYSPLL_ERR_01 Workaround */
/* Represent 1.000 as 1000 */
#define FLOAT_TO_INT_SCALE                                               (1000U)
#define FCC_EXPECTED_RATIO                                                  1000
#define FCC_UPPER_BOUND                       (FCC_EXPECTED_RATIO * (1 + 0.003))
#define FCC_LOWER_BOUND                       (FCC_EXPECTED_RATIO * (1 - 0.003))

bool SYSCFG_DL_SYSCTL_SYSPLL_init(void);


/* Defines for DC_MOTOR */
#define DC_MOTOR_INST                                                      TIMG0
#define DC_MOTOR_INST_IRQHandler                                TIMG0_IRQHandler
#define DC_MOTOR_INST_INT_IRQN                                  (TIMG0_INT_IRQn)
#define DC_MOTOR_INST_CLK_FREQ                                          40000000
/* GPIO defines for channel 0 */
#define GPIO_DC_MOTOR_C0_PORT                                              GPIOA
#define GPIO_DC_MOTOR_C0_PIN                                      DL_GPIO_PIN_12
#define GPIO_DC_MOTOR_C0_IOMUX                                   (IOMUX_PINCM34)
#define GPIO_DC_MOTOR_C0_IOMUX_FUNC                  IOMUX_PINCM34_PF_TIMG0_CCP0
#define GPIO_DC_MOTOR_C0_IDX                                 DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_DC_MOTOR_C1_PORT                                              GPIOA
#define GPIO_DC_MOTOR_C1_PIN                                      DL_GPIO_PIN_13
#define GPIO_DC_MOTOR_C1_IOMUX                                   (IOMUX_PINCM35)
#define GPIO_DC_MOTOR_C1_IOMUX_FUNC                  IOMUX_PINCM35_PF_TIMG0_CCP1
#define GPIO_DC_MOTOR_C1_IDX                                 DL_TIMER_CC_1_INDEX




/* Defines for TB6612_ENA */
#define TB6612_ENA_INST                                                    TIMG8
#define TB6612_ENA_INST_IRQHandler                              TIMG8_IRQHandler
#define TB6612_ENA_INST_INT_IRQN                                (TIMG8_INT_IRQn)
/* Pin configuration defines for TB6612_ENA PHA Pin */
#define GPIO_TB6612_ENA_PHA_PORT                                           GPIOB
#define GPIO_TB6612_ENA_PHA_PIN                                   DL_GPIO_PIN_15
#define GPIO_TB6612_ENA_PHA_IOMUX                                (IOMUX_PINCM32)
#define GPIO_TB6612_ENA_PHA_IOMUX_FUNC               IOMUX_PINCM32_PF_TIMG8_CCP0
/* Pin configuration defines for TB6612_ENA PHB Pin */
#define GPIO_TB6612_ENA_PHB_PORT                                           GPIOB
#define GPIO_TB6612_ENA_PHB_PIN                                   DL_GPIO_PIN_16
#define GPIO_TB6612_ENA_PHB_IOMUX                                (IOMUX_PINCM33)
#define GPIO_TB6612_ENA_PHB_IOMUX_FUNC               IOMUX_PINCM33_PF_TIMG8_CCP1


/* Defines for TB6612_ENB */
#define TB6612_ENB_INST                                                  (TIMG7)
#define TB6612_ENB_INST_IRQHandler                              TIMG7_IRQHandler
#define TB6612_ENB_INST_INT_IRQN                                (TIMG7_INT_IRQn)
#define TB6612_ENB_INST_LOAD_VALUE                                      (63999U)
/* GPIO defines for channel 0 */
#define GPIO_TB6612_ENB_C0_PORT                                            GPIOA
#define GPIO_TB6612_ENB_C0_PIN                                    DL_GPIO_PIN_28
#define GPIO_TB6612_ENB_C0_IOMUX                                  (IOMUX_PINCM3)
#define GPIO_TB6612_ENB_C0_IOMUX_FUNC                 IOMUX_PINCM3_PF_TIMG7_CCP0
#define TB6612_ENB_INST_PUB_0_CH                                             (1)






/* Defines for I2C_0 */
#define I2C_0_INST                                                          I2C0
#define I2C_0_INST_IRQHandler                                    I2C0_IRQHandler
#define I2C_0_INST_INT_IRQN                                        I2C0_INT_IRQn
#define I2C_0_BUS_SPEED_HZ                                                100000
#define GPIO_I2C_0_SDA_PORT                                                GPIOA
#define GPIO_I2C_0_SDA_PIN                                         DL_GPIO_PIN_0
#define GPIO_I2C_0_IOMUX_SDA                                      (IOMUX_PINCM1)
#define GPIO_I2C_0_IOMUX_SDA_FUNC                       IOMUX_PINCM1_PF_I2C0_SDA
#define GPIO_I2C_0_SCL_PORT                                                GPIOA
#define GPIO_I2C_0_SCL_PIN                                         DL_GPIO_PIN_1
#define GPIO_I2C_0_IOMUX_SCL                                      (IOMUX_PINCM2)
#define GPIO_I2C_0_IOMUX_SCL_FUNC                       IOMUX_PINCM2_PF_I2C0_SCL


/* Defines for sys_uart */
#define sys_uart_INST                                                      UART0
#define sys_uart_INST_FREQUENCY                                         40000000
#define sys_uart_INST_IRQHandler                                UART0_IRQHandler
#define sys_uart_INST_INT_IRQN                                    UART0_INT_IRQn
#define GPIO_sys_uart_RX_PORT                                              GPIOA
#define GPIO_sys_uart_TX_PORT                                              GPIOA
#define GPIO_sys_uart_RX_PIN                                      DL_GPIO_PIN_11
#define GPIO_sys_uart_TX_PIN                                      DL_GPIO_PIN_10
#define GPIO_sys_uart_IOMUX_RX                                   (IOMUX_PINCM22)
#define GPIO_sys_uart_IOMUX_TX                                   (IOMUX_PINCM21)
#define GPIO_sys_uart_IOMUX_RX_FUNC                    IOMUX_PINCM22_PF_UART0_RX
#define GPIO_sys_uart_IOMUX_TX_FUNC                    IOMUX_PINCM21_PF_UART0_TX
#define sys_uart_BAUD_RATE                                              (115200)
#define sys_uart_IBRD_40_MHZ_115200_BAUD                                    (21)
#define sys_uart_FBRD_40_MHZ_115200_BAUD                                    (45)




/* Defines for W25Q64 */
#define W25Q64_INST                                                        SPI1
#define W25Q64_INST_IRQHandler                                  SPI1_IRQHandler
#define W25Q64_INST_INT_IRQN                                      SPI1_INT_IRQn
#define GPIO_W25Q64_PICO_PORT                                             GPIOB
#define GPIO_W25Q64_PICO_PIN                                      DL_GPIO_PIN_8
#define GPIO_W25Q64_IOMUX_PICO                                  (IOMUX_PINCM25)
#define GPIO_W25Q64_IOMUX_PICO_FUNC                  IOMUX_PINCM25_PF_SPI1_PICO
#define GPIO_W25Q64_POCI_PORT                                             GPIOB
#define GPIO_W25Q64_POCI_PIN                                      DL_GPIO_PIN_7
#define GPIO_W25Q64_IOMUX_POCI                                  (IOMUX_PINCM24)
#define GPIO_W25Q64_IOMUX_POCI_FUNC                  IOMUX_PINCM24_PF_SPI1_POCI
/* GPIO configuration for W25Q64 */
#define GPIO_W25Q64_SCLK_PORT                                             GPIOB
#define GPIO_W25Q64_SCLK_PIN                                      DL_GPIO_PIN_9
#define GPIO_W25Q64_IOMUX_SCLK                                  (IOMUX_PINCM26)
#define GPIO_W25Q64_IOMUX_SCLK_FUNC                  IOMUX_PINCM26_PF_SPI1_SCLK



/* Defines for DMA_CH0 */
#define DMA_CH0_CHAN_ID                                                      (0)
#define DMA_CH0_TRIGGER_SEL_FSUB_1                       (DMA_GENERIC_SUB1_TRIG)


/* Port definition for Pin Group LED */
#define LED_PORT                                                         (GPIOB)

/* Defines for PIN_22: GPIOB.22 with pinCMx 50 on package pin 21 */
#define LED_PIN_22_PIN                                          (DL_GPIO_PIN_22)
#define LED_PIN_22_IOMUX                                         (IOMUX_PINCM50)
/* Port definition for Pin Group CS */
#define CS_PORT                                                          (GPIOB)

/* Defines for SPI1_CS: GPIOB.6 with pinCMx 23 on package pin 58 */
#define CS_SPI1_CS_PIN                                           (DL_GPIO_PIN_6)
#define CS_SPI1_CS_IOMUX                                         (IOMUX_PINCM23)
/* Port definition for Pin Group ENCODER */
#define ENCODER_PORT                                                     (GPIOA)

/* Defines for KEY: GPIOA.26 with pinCMx 59 on package pin 30 */
#define ENCODER_KEY_PIN                                         (DL_GPIO_PIN_26)
#define ENCODER_KEY_IOMUX                                        (IOMUX_PINCM59)
/* Defines for encodera: GPIOA.24 with pinCMx 54 on package pin 25 */
#define ENCODER_encodera_PIN                                    (DL_GPIO_PIN_24)
#define ENCODER_encodera_IOMUX                                   (IOMUX_PINCM54)
/* Defines for encoderb: GPIOA.25 with pinCMx 55 on package pin 26 */
#define ENCODER_encoderb_PIN                                    (DL_GPIO_PIN_25)
#define ENCODER_encoderb_IOMUX                                   (IOMUX_PINCM55)
/* Defines for M_encoder: GPIOA.29 with pinCMx 4 on package pin 36 */
#define ENCODER_M_encoder_PIN                                   (DL_GPIO_PIN_29)
#define ENCODER_M_encoder_IOMUX                                   (IOMUX_PINCM4)
/* Port definition for Pin Group LCD */
#define LCD_PORT                                                         (GPIOB)

/* Defines for LCD_RES: GPIOB.10 with pinCMx 27 on package pin 62 */
#define LCD_LCD_RES_PIN                                         (DL_GPIO_PIN_10)
#define LCD_LCD_RES_IOMUX                                        (IOMUX_PINCM27)
/* Defines for LCD_DC: GPIOB.11 with pinCMx 28 on package pin 63 */
#define LCD_LCD_DC_PIN                                          (DL_GPIO_PIN_11)
#define LCD_LCD_DC_IOMUX                                         (IOMUX_PINCM28)
/* Defines for LCD_CS: GPIOB.14 with pinCMx 31 on package pin 2 */
#define LCD_LCD_CS_PIN                                          (DL_GPIO_PIN_14)
#define LCD_LCD_CS_IOMUX                                         (IOMUX_PINCM31)
/* Defines for LCD_BLK: GPIOB.26 with pinCMx 57 on package pin 28 */
#define LCD_LCD_BLK_PIN                                         (DL_GPIO_PIN_26)
#define LCD_LCD_BLK_IOMUX                                        (IOMUX_PINCM57)
/* Defines for BUTTON1: GPIOA.27 with pinCMx 60 on package pin 31 */
#define BUTTON_BUTTON1_PORT                                              (GPIOA)
#define BUTTON_BUTTON1_PIN                                      (DL_GPIO_PIN_27)
#define BUTTON_BUTTON1_IOMUX                                     (IOMUX_PINCM60)
/* Defines for BUTTON2: GPIOB.27 with pinCMx 58 on package pin 29 */
#define BUTTON_BUTTON2_PORT                                              (GPIOB)
#define BUTTON_BUTTON2_PIN                                      (DL_GPIO_PIN_27)
#define BUTTON_BUTTON2_IOMUX                                     (IOMUX_PINCM58)
/* Defines for AIN1: GPIOA.22 with pinCMx 47 on package pin 18 */
#define TB6612_AIN1_PORT                                                 (GPIOA)
#define TB6612_AIN1_PIN                                         (DL_GPIO_PIN_22)
#define TB6612_AIN1_IOMUX                                        (IOMUX_PINCM47)
/* Defines for AIN2: GPIOB.21 with pinCMx 49 on package pin 20 */
#define TB6612_AIN2_PORT                                                 (GPIOB)
#define TB6612_AIN2_PIN                                         (DL_GPIO_PIN_21)
#define TB6612_AIN2_IOMUX                                        (IOMUX_PINCM49)
/* Defines for BIN1: GPIOB.23 with pinCMx 51 on package pin 22 */
#define TB6612_BIN1_PORT                                                 (GPIOB)
#define TB6612_BIN1_PIN                                         (DL_GPIO_PIN_23)
#define TB6612_BIN1_IOMUX                                        (IOMUX_PINCM51)
/* Defines for BIN2: GPIOA.23 with pinCMx 53 on package pin 24 */
#define TB6612_BIN2_PORT                                                 (GPIOA)
#define TB6612_BIN2_PIN                                         (DL_GPIO_PIN_23)
#define TB6612_BIN2_IOMUX                                        (IOMUX_PINCM53)




/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_SYSCTL_CLK_init(void);

bool SYSCFG_DL_SYSCTL_SYSPLL_init(void);
void SYSCFG_DL_DC_MOTOR_init(void);
void SYSCFG_DL_TB6612_ENA_init(void);
void SYSCFG_DL_TB6612_ENB_init(void);
void SYSCFG_DL_I2C_0_init(void);
void SYSCFG_DL_sys_uart_init(void);
void SYSCFG_DL_W25Q64_init(void);
void SYSCFG_DL_DMA_init(void);

void SYSCFG_DL_SYSTICK_init(void);

bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
